[
  {
    "level": "A1",
    "name": "Principiante",
    "synopsis": "Aquí dices tus primeras frases en alemán",
    "timenormal": "2-3 meses",
    "timeintensive": "4-6 semanas",
    "description": "Entiendes y utilizas expresiones cotidianas y frases sencillas para satisfacer necesidades concretas. Puedes presentarte a ti mismo y a otros, hacer preguntas personales, como dónde viven, a quién conocen o qué cosas tienen, y responder a este tipo de preguntas. Te comunicas de forma sencilla siempre que tus interlocutores hablen despacio, claro y estén dispuestos a ayudarte. ¡Empieza a desenvolverte en alemán desde el primer día!",
    "goals": [
      "comprender y utilizar expresiones conocidas y frases sencillas en situaciones cotidianas.",
      "presentarte a ti mismo y a otras personas, y hacer preguntas sencillas.",
      "responder a preguntas sencillas.",
      "mantener conversaciones simples si te hablan de manera lenta y clara."
    ]
  },
  {
    "level": "A2",
    "name": "Fundamentos",
    "synopsis": "Aquí profundizas tus primeros conocimientos de alemán.",
    "timenormal": "2-3 meses",
    "timeintensive": "4-6 semanas",
    "description": "Puedes entender frases y expresiones de uso frecuente relacionadas con áreas de importancia inmediata (por ejemplo, información personal y familiar, compras, trabajo, entorno cercano). Puedes comunicarte en situaciones simples y rutinarias donde se trata de un intercambio directo y sencillo de información sobre temas conocidos y habituales. También puedes describir con medios sencillos tu origen, formación, entorno cercano y cosas relacionadas con necesidades inmediatas.",
    "goals": [
      "comprender y reaccionar a expresiones y frases de uso frecuente.",
      "comunicarte en situaciones simples e intercambiar información.",
      "hablar sobre tu origen, formación y entorno directo, y describir tus necesidades."
    ]
  },
  {
    "level": "B1",
    "name": "Avanzado",
    "synopsis": "Aquí completas las bases.",
    "timenormal": "3-4 meses",
    "timeintensive": "1-2 meses",
    "description": "Puedes entender los puntos principales cuando se utiliza un lenguaje estándar claro y cuando se trata de temas conocidos relacionados con el trabajo, la escuela, el tiempo libre, etc. Puedes manejar la mayoría de las situaciones que surgen al viajar en una región de habla alemana. Puedes expresarte de forma sencilla y coherente sobre temas conocidos y áreas de interés personal. También puedes contar experiencias y eventos, describir sueños, esperanzas y objetivos, y dar breves justificaciones o explicaciones sobre planes y opiniones.",
    "goals": [
      "entender los puntos principales en un alemán estándar claro.",
      "superar la mayoría de las situaciones que encuentras en la vida cotidiana y al viajar.",
      "intercambiar ideas de manera coherente sobre temas e intereses conocidos.",
      "hablar sobre experiencias e ideas."
    ]
  },
  {
    "level": "B2",
    "name": "Independiente",
    "synopsis": "Aquí profundizas tus conocimientos, también para estudios y trabajo.",
    "timenormal": "4-6 meses",
    "timeintensive": "2-3 meses",
    "description": "Puedes entender los contenidos principales de textos complejos sobre temas concretos y abstractos, incluyendo discusiones técnicas en tu área de especialización. Puedes comunicarte de forma espontánea y fluida y mantener una conversación normal con hablantes nativos resulta fácil y sin esfuerzo para ambas partes. También puedes expresarte de manera clara y detallada sobre una amplia gama de temas, explicar tu punto de vista sobre una cuestión actual y señalar las ventajas y desventajas de distintas opciones.",
    "goals": [
      "entender los contenidos principales de temas complejos y textos abstractos, incluidas discusiones técnicas en tu campo.",
      "expresarte de manera espontánea y fluida, tanto por escrito como oralmente.",
      "explicar tu punto de vista y mencionar ventajas y desventajas."
    ]
  },
  {
    "level": "C1",
    "name": "Competente",
    "synopsis": "Aquí aprendes alemán a un nivel de idioma competente.",
    "timenormal": "6-12 meses",
    "timeintensive": "3-6 meses",
    "description": "Puedes entender una amplia variedad de textos complejos y extensos, captando incluso significados implícitos. Puedes expresarte de manera espontánea y fluida, sin que sea evidente que buscas palabras con frecuencia. Usas el idioma de forma efectiva y flexible en contextos sociales, profesionales, educativos o académicos. También puedes expresarte de manera clara, estructurada y detallada sobre temas complejos, utilizando diversos recursos de cohesión textual de forma adecuada.",
    "goals": [
      "entender una amplia gama de textos complejos y extensos, incluso con significado implícito.",
      "expresarte de manera espontánea y fluida, sin buscar palabras con frecuencia.",
      "usar el idioma en contextos profesionales y sociales.",
      "expresarte de manera estructurada, precisa y detallada.",
      "usar los recursos lingüísticos de manera adecuada."
    ]
  },
  {
    "level": "C2",
    "name": "Nativo",
    "synopsis": "Aquí alcanzas el nivel más alto del idioma.",
    "timenormal": "6-12 meses",
    "timeintensive": "3-6 meses",
    "description": "Puedes entender prácticamente todo lo que lees o escuchas sin esfuerzo. Puedes resumir información de diversas fuentes escritas y orales, presentando razones y explicaciones de forma coherente. Puedes expresarte de manera espontánea, muy fluida y precisa, dejando claras incluso los matices más sutiles en temas más complejos.",
    "goals": [
      "entender casi todo lo que lees o escuchas sin esfuerzo.",
      "resumir información de fuentes escritas y orales y explicar tu punto de vista al respecto.",
      "mantener discusiones coherentes, incluso en áreas especializadas.",
      "expresarte de manera espontánea, fluida y sin errores, incluso sobre temas complejos."
    ]
  }
]
